In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.DataFrame([{"aa":1,"bb":2},{"bb":5,"cc":5}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   5  5.0

In [4]:
pd.DataFrame(np.random.randint(2,76), index=[1,2,3,4] , columns =["john","steve","Kevin","jacob"] )

   john  steve  Kevin  jacob
1    19     19     19     19
2    19     19     19     19
3    19     19     19     19
4    19     19     19     19

In [5]:
df=pd.Index([1,2,3,4,5,6])
df

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [6]:
df[2]

3

In [8]:
df[2:5:2]

Int64Index([3, 5], dtype='int64')

In [19]:
rng= np.random.RandomState(10)
ser= pd.Series(rng.randint(0,10,4))
ser

0    9
1    4
2    0
3    1
dtype: int32

In [25]:
dfr = pd.DataFrame(rng.randint(0,10,(5,4)), columns= ["A","B","C","D"])
dfr

   A  B  C  D
0  9  0  1  8
1  9  0  8  6
2  4  3  0  4
3  6  8  1  8
4  4  1  3  6

In [26]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
dtype: float64

In [27]:
np.tan(dfr * np.pi/7)

          A         B         C         D
0  1.253960  0.000000  0.481575  0.481575
1  1.253960  0.000000  0.481575 -0.481575
2 -4.381286  4.381286  0.000000 -4.381286
3 -0.481575  0.481575  0.481575  0.481575
4 -4.381286  0.481575  4.381286 -0.481575

In [32]:
 area = pd.Series({"Newyork":878799,"Toronto":555489,"Chennai":898709},name="Area")
    
population= pd.Series({"Newyork":8998008,"Toronto":9898990,"Bangalore":897799},name="Population")

print(area)
population

Newyork    878799
Toronto    555489
Chennai    898709
Name: Area, dtype: int64

Newyork      8998008
Toronto      9898990
Bangalore     897799
Name: Population, dtype: int64

In [34]:
population / area

Bangalore          NaN
Chennai            NaN
Newyork      10.238983
Toronto      17.820317
dtype: float64

In [35]:
A=pd.Series([1,2,3],index=[0,1,2])
B=pd.Series([5,5,6],index=[1,2,3])

In [38]:
print(A)
print(B)
A+B

0    1
1    2
2    3
dtype: int64
1    5
2    5
3    6
dtype: int64

0    NaN
1    7.0
2    8.0
3    NaN
dtype: float64

In [47]:
A.add(B,fill_value=0)

0    1.0
1    7.0
2    8.0
3    6.0
dtype: float64

In [48]:

df

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [50]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [51]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [52]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [53]:
df.merge(df2)

   Year Province  Literacy Population
0  2013       FL       0.2     100000
1  2014       FL       0.1     100000
2  2013       NH       0.5     200000
3  2014       NH       0.3     200000
4  2014       ZH       0.5     300000

In [54]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy province Population
0  2013       FL       0.2       FL     100000
1  2014       FL       0.1       FL     100000
2  2013       NH       0.5       NH     200000
3  2014       NH       0.3       NH     200000

In [55]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy province Population
0  2013       FL       0.2       FL     100000
1  2014       FL       0.1       FL     100000
2  2013       NH       0.5       NH     200000
3  2014       NH       0.3       NH     200000

In [56]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

   Year Province  Literacy Population
0  2013       FL       0.2     100000
1  2013       FL       0.2      50000
2  2014       FL       0.1     100000
3  2014       FL       0.1      50000
4  2013       NH       0.5     200000
5  2014       NH       0.3     200000
6  2014       ZH       0.5        NaN

In [57]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [58]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [59]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [60]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [61]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64